Repository: habalux/incubator-superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: fi

source: Bubble Size
fi: Kuplan koko

source: The URL, this control is templated, so you can integrate {{ width }} and/or {{ height }} in your URL string.
fi: URL, eli osoite käyttää templatea, joten voi upottaa asetukset {{ width }} ja/tai {{ height }} merkkijonoon.

source: X Axis Label
fi: X-akselin nimi

source: Y Axis Label
fi: Y-akselin nimi

source: Custom WHERE clause
fi: Oma WHERE-lauseke

source: The text in this box gets included in your query's WHERE clause, as an AND to other criteria. You can include complex expression, parenthesis and anything else supported by the backend it is directed towards.
fi: Tähän laatikkoon syötetty teksti lisätään kyselyyn WHERE-lauseeseen yhdistettynä AND-operaatiolla muihin ehtolauseisiin. Voit käyttää mitä tahansa käytössä olevan tietokannan tukemia lausekkeita.

source: Custom HAVING clause
fi: Oma HAVING-lauseke

source: The text in this box gets included in your query's HAVING clause, as an AND to other criteria. You can include complex expression, parenthesis and anything else supported by the backend it is directed towards.
fi: Tähän laatikkoon syötetty teksti lisätään kyselyyn HAVING-lauseeseen yhdistettynä AND-operaatiolla muihin ehtolauseisiin. Voit käyttää mitä tahansa käytössä olevan tietokannan tukemia lausekkeita.

source: Comparison Period Lag
fi: Vertailujakson viive

source: Based on granularity, number of time periods to compare against
fi: Kuinka monta jaksoa verrataan, suhteessa aikarakeisuuteen

source: Comparison suffix
fi: Vertailun jälkiliite

source: Suffix to apply after the percentage display
fi: Tämä lisätään prosenttinäytön perään

source: Table Timestamp Format
fi: Taulun aikaleiman muoto

source: Timestamp Format
fi: Aikaleiman muoto

source: Series Height
fi: Sarjan korkeus

source: Pixel height of each series
fi: Kunkin sarjan korkeus pikseleinä

source: Page Length
fi: Sivun pituus

source: Rows per page, 0 means no pagination
fi: Rivejä per sivu, 0 kytkee sivutuksen pois

source: X Axis Format
fi: X-akselin muoto

source: Y Axis Format
fi: Y-akselin muoto

source: Right Axis Format
fi: Oikean akselin muoto

source: Date Time Format
fi: Päivämäärä ja ajan muoto

source: Markup Type
fi: Kuvauksen tyyppi

source: Pick your favorite markup language
fi: Valitse haluamasi kuvauskieli

source: Rotation
fi: Kierto

source: Rotation to apply to words in the cloud
fi: Sanapilven sanoihin lisätty kierto

source: Line Style
fi: Viivan tyyli

source: Line interpolation as defined by d3.js
fi: Viivan jaksotus, jonka määrittää d3.js

source: Label Type
fi: Merkin tyyppi

source: What should be shown on the label?
fi: Mitä merkissä tulisi näyttää?

source: Code
fi: Koodi

source: Put your code here
fi: Syötä koodisi tähän

source: Aggregation function
fi: Koontifunktio

source: Aggregate function to apply when pivoting and computing the total rows and columns
fi: Koontifunktio jota käytetään rivien ja sarakkeiden pivot- ja summausoperaatioissa

source: Font Size From
fi: Kirjasinkoon määritys

source: Font size for the smallest value in the list
fi: Fontin koko listan pienimmälle arvolle

source: Font size for the biggest value in the list
fi: Fontin koko listan suurimmalle arvolle

source: Instant Filtering
fi: Välitön suodatus

source: Range Filter
fi: Rajasuodatin

source: Whether to display the time range interactive selector
fi: Näytetäänkö aikarajasuodatin valintaelementissä

source: Date Filter
fi: Päivämääräsuodatin

source: Whether to include a time filter
fi: Näytetäänkö aikasuodatin

source: Show SQL Granularity Dropdown
fi: Näytä SQL-rakeisuuden valintalista

source: Check to include SQL Granularity dropdown
fi: Valitse jos haluat näyttää SQL-rakeisuuden valintalistan

source: Show SQL Time Column
fi: Näytä SQL-aikasarake

source: Check to include Time Column dropdown
fi: Valitse jos haluat näyttää SQL-aikasarakkeen valintalistan

source: Show Druid Granularity Dropdown
fi: Näytä Druid-rakeisuuden valintalista

source: Check to include Druid Granularity dropdown
fi: Valitse jos haluat näyttää Druid-rakeisuuden valintalistan

source: Show Druid Time Origin
fi: Näytä Druid-aikalähde

source: Check to include Time Origin dropdown
fi: Valitse jos haluat näyttää Druid-aikalähteen valintalistan

source: Data Table
fi: Tietotaulukko

source: Whether to display the interactive data table
fi: Näytetäänkö interaktiivinen tietotaulukko

source: Search Box
fi: Hakulaatikko

source: Whether to include a client side search box
fi: Näytetäänkö selainpohjainen hakulaatikko

source: Table Filter
fi: Taulusuodatin

source: Whether to apply filter when table cell is clicked
fi: Suodatetaanko taulun solua klikkaamalla

source: Show Bubbles
fi: Näytä kuplat

source: Whether to display bubbles on top of countries
fi: Näytetäänkö maiden päällä kuplat

source: Legend
fi: Kuvateksti

source: Whether to display the legend (toggles)
fi: Näytetäänkö kuvateksti (päälle/pois)

source: Show Values
fi: Näytä arvot

source: Whether to display the numerical values within the cells
fi: Näytetäänkö soluissa numeeriset arvot

source: X bounds
fi: X-rajat

source: Whether to display the min and max values of the X axis
fi: Näytetäänkö X-akselin minimi- ja maksimiarvot

source: Y bounds
fi: Y-rajat

source: Whether to display the min and max values of the Y axis
fi: Näytetäänkö Y-akselin minimi- ja maksimiarvot

source: Rich Tooltip
fi: Edistyneempi työkaluvinkki

source: The rich tooltip shows a list of all series for that point in time
fi: Näytetäänkö työkaluvinkin yhteydessä kaikki sarja kyseiselle ajanhetkelle

source: Y Log Scale
fi: Y-akseli logaritminen

source: Use a log scale for the Y axis
fi: Käytä logaritmista skaalausta Y-akselille

source: X Log Scale
fi: X-akseli logaritminen

source: Use a log scale for the X axis
fi: Käytä logaritmista skaalausta X-akselille

source: Log Scale
fi: Logaritminen skaalaus

source: Use a log scale
fi: Käytä logaritmista skaalausta

source: Donut
fi: Donitsi

source: Do you want a donut or a pie?
fi: Haluatko donitsin vai piirakan?

source: Put labels outside
fi: Sijoita merkinnät ulkopuolelle

source: Put the labels outside the pie?
fi: Haluatko sijoittaa merkinnät piirakan ulkopuolelle?

source: Contribution
fi: Osuudet

source: Compute the contribution to the total
fi: Laske osuudet kokonaissummaan verrattuna

source: Period Ratio
fi: Jakson suhde

source: [integer] Number of period to compare against, this is relative to the granularity selected
fi: [kokonaisluku] Vertailujaksojen määrä suhteessa valittuun rakeisuuteen

source: Period Ratio Type
fi: Jakson suhteen tyyppi

source: `factor` means (new/previous), `growth` is ((new/previous) - 1), `value` is (new-previous)
fi: `factor` on (uusi/edellinen), `growth` on ((uusi/edellinen) - 1), `value` on (uusi-edellinen)

source: Time Shift
fi: Ajansiirto

source: Subheader
fi: Aliotsikko

source: Description text that shows up below your Big Number
fi: Kuvaus joka näkyy Ison Numeron alla

source: label
fi: nimi

source: Map Style
fi: Kartan tyyli

source: Base layer map style
fi: Pohjakerroksen kartan tyyli

source: Clustering Radius
fi: Ryhmittelyn säde

source: The radius (in pixels) the algorithm uses to define a cluster. Choose 0 to turn off clustering, but beware that a large number of points (>1000) will cause lag.
fi: Säde (pikseleitä) jota käytetään pisteiden ryhmittelyyn. Syötä 0 jos et haluat ryhmittelyä. Ota huomioon että suuri datapisteiden määrä (>1000) aiheuttaa hitautta.

source: Point Radius
fi: Pisteen säde

source: The radius of individual points (ones that are not in a cluster). Either a numerical column or `Auto`, which scales the point based on the largest cluster
fi: Yksittäisten (ryhmittelemättömien) pisteiden koko. Anna joko numeerinen sarake tai `Auto`, jolloin koko määräytyy suurimman ryhmittymän mukaan

source: Point Radius Unit
fi: Pisteen säteen yksikkö

source: The unit of measure for the specified point radius
fi: Mittayksikkö jota käytetään pisteiden säteeseen

source: Opacity
fi: Läpikuultavuus

source: Opacity of all clusters, points, and labels. Between 0 and 1.
fi: Kaikkien pisteiden, ryhmien ja nimien läpikuultavuus. Välillä 0.0 ... 1.0.

source: Zoom
fi: Zoomaus

source: Zoom level of the map
fi: Kartan zoomaustaso

source: Default latitude
fi: Oletusleveysaste

source: Latitude of default viewport
fi: Oletusnäkymän leveysaste

source: Default longitude
fi: Oletuspituusaste

source: Longitude of default viewport
fi: Oletusnäkymän pituusaste

source: Live render
fi: Reaaliaikainen näyttö

source: Points and clusters will update as viewport is being changed
fi: Pisteet ja ryhmittymät päivittyvät samalla kun näkymää muutetaan

source: RGB Color
fi: RGB-väri

source: The color for points and clusters in RGB
fi: RGB-väri pisteille ja ryhmille

source: Color
fi: Väri

source: Pick a color
fi: Valitse väri

source: Ranges
fi: Rajat

source: Ranges to highlight with shading
fi: Varjostuksella korostettavat rajat

source: Range labels
fi: Rajojen nimet

source: Labels for the ranges
fi: Nimet rajoille

source: Markers
fi: Merkit

source: List of values to mark with triangles
fi: Lista arvoista jotka tulee merkitä kolmioilla

source: Marker labels
fi: Merkkien nimet

source: Labels for the markers
fi: Nimet merkeille

source: Marker lines
fi: Merkkien viivat

source: List of values to mark with lines
fi: Lista arvoista jotka tulee merkitä viivalla

source: Marker line labels
fi: Merkkilinjojen nimet

source: Labels for the marker lines
fi: Nimet merkkilinjoille

source: Slice ID
fi: Siivun ID

source: The id of the active slice
fi: Aktiivisen siivun ID

source: Cache Timeout (seconds)
fi: Välimuistin aikaraja (sekuntia)

source: The number of seconds before expiring the cache
fi: Kuinka monta sekuntia välimuistia säilytetään

source: Order by entity id
fi: Järjestä kokonaisuuksien ID:iden mukaan

source: Important! Select this if the table is not already sorted by entity id, else there is no guarantee that all events for each entity are returned.
fi: Tärkeää! Valitse tämä jos taulu ei ole valmiiksi järjestetty id-numeron mukaisesti. Muuten osa kunkin objektin tapahtumista saattaa jäädä pois tuloksista.

source: Minimum leaf node event count
fi: Lehtisolmujen pienin tapahtumamäärä

source: Leaf nodes that represent fewer than this number of events will be initially hidden in the visualization
fi: Lehtisolmut joilla on tätä pienempi määrä tapahtumia ovat alustavasti piilotettuja

source: Color Scheme
fi: Väriskeema

source: The color scheme for rendering chart
fi: Kaaviossa näytettävä väriskeema

source: Significance Level
fi: Merkittävyystaso

source: Threshold alpha level for determining significance
fi: Alpha-kynnystaso merkittävyyden päättelyyn

source: p-value precision
fi: p-arvon tarkkuus

source: Number of decimal places with which to display p-values
fi: Kuinka monella desimaalilla p-arvo esitetään

source: Lift percent precision
fi: Nostoprosentin tarkkuus

source: Number of decimal places with which to display lift values
fi: Kuinka monella desimaalilla nostoarvot esitetään

source: Time Series Columns
fi: Aikasarjan sarakkeet

source: Options
fi: Valinnat

source: Not Time Series
fi: Ei aikasarja

source: Ignore time
fi: Sivuuta aika

source: Time Series
fi: Aikasarja

source: Standard time series
fi: Vakio aikasarja

source: Aggregate Mean
fi: Keskivertokoonti

source: Mean of values over specified period
fi: Keskivertoarvo määrätyn jakson aikana

source: Aggregate Sum
fi: Summakoonti

source: Sum of values over specified period
fi: Summaa arvot määrätyn jakson ajalta

source: Difference
fi: Erotus

source: Metric change in value from `since` to `until`
fi: Metriikan arvon muutos välillä `Alkaen` - `Asti`

source: Percent Change
fi: Prosenttimuutos

source: Metric percent change in value from `since` to `until`
fi: Metriikan arvon muutosprosentti välillä `Alkaen` - `Asti`

source: Factor
fi: Kerroin

source: Metric factor change from `since` to `until`
fi: Kerroin välillä `Alkaen` - `Asti`

source: Advanced Analytics
fi: Edistynyt analytiikka

source: Use the Advanced Analytics options below
fi: Käytä alla olevia edistyneen analytiikan valintoja

source: Settings for time series
fi: Aikasarjan asetukset

source: Equal Date Sizes
fi: Täsmäävien päivien koko

source: Check to force date partitions to have the same height
fi: Valitse jos haluat että päiväosioilla on sama korkeus

source: Partition Limit
fi: Rajoita osioita

source: The maximum number of subdivisions of each group; lower values are pruned first
fi: Maksimimäärä osia kullekin ryhmälle; pienimmät arvot karsitaan ensin

source: Partition Threshold
fi: Osiointikynnys

source: Partitions whose height to parent height proportions are below this value are pruned
fi: Karsi osiot joiden korkeus suhteessa ylempään tasoon on pienempi kuin tämä arvo

source: Time
fi: Aika

source: Time related form attributes
fi: Aikaan liittyvät valinnat

source: Datasource & Chart Type
fi: Tietolähde & Kaavion tyyppi

source: This section exposes ways to include snippets of SQL in your query
fi: Tässä osiossa voit liittää SQL-lauseita kyselyysi

source: Annotations
fi: Huomautukset

source: This section contains options that allow for advanced analytical post processing of query results
fi: Tämä osio sisältää valintoja joilla voit suorittaa kehittyneempää analyyttistä jälkikäsittelyä kyselyn tuloksille

source: Result Filters
fi: Tulosten suodatus

source: The filters to apply after post-aggregation.Leave the value control empty to filter empty strings or nulls
fi: Suodattimet joita käytetään koonnin jälkeen. Jätä arvo tyhjäksi jos haluat suodattaa tyhjiä merkkijonoja tai NULL-arvoja

source: Chart Options
fi: Kaavion asetukset

source: Breakdowns
fi: Erittelyt

source: Defines how each series is broken down
fi: Määrittää miten kukin sarja eritellään

source: Pie Chart
fi: Piirakkakaavio

source: Dual Axis Line Chart
fi: Kaksoisakselinen viivakaavio

source: Y Axis 1
fi: Y-akseli 1

source: Y Axis 2
fi: Y-akseli 2

source: Left Axis Metric
fi: Vasemman akselin metriikka

source: Choose a metric for left axis
fi: Valitse metriikka vasemmanpuoleiselle akselille

source: Left Axis Format
fi: Vasemman akselin muoto

source: Axes
fi: Akselit

source: Use this section if you want a query that aggregates
fi: Käytä tätä osaa jos haluat koontikyselyn

source: Use this section if you want to query atomic rows
fi: Käytä tätä osiota jos haluat suorittaa kyselyn atomisesti

source: Time Series Table
fi: Aikasarjataulu

source: Templated link, it's possible to include {{ metric }} or other values coming from the controls.
fi: Linkkipohja, voit käyttää {{ metric }} tai muita muuttujia joita määritetään valintojen avulla.

source: Pivot Options
fi: Pivot-asetukset

source: Bubbles
fi: Kuplat

source: Numeric Column
fi: Numeerinen sarake

source: Select the numeric column to draw the histogram
fi: Valitse histogrammiin käytettävä numeerinen sarake

source: No of Bins
fi: Astioiden lukumäärä

source: Select number of bins for the histogram
fi: Valitse haluttu määrä astioita histogrammille

source: Primary Metric
fi: Ensisijainen metriikka

source: The primary metric is used to define the arc segment sizes
fi: Ensisijainen metriikka joka määrittää kaaren segmentin koon

source: Secondary Metric
fi: Toissijainen metriikka

source: This secondary metric is used to define the color as a ratio against the primary metric. If the two metrics match, color is mapped level groups
fi: Toissijainen metriikka määrittää värin suhteessa ensisijaiseen metriikkaan. Jos kummatkin metriikat täsmäävät, väri määräytyy tasoryhmittäin

source: Hierarchy
fi: Hierarkia

source: This defines the level of the hierarchy
fi: Tämä määrittää hierarkiatasot

source: Source / Target
fi: Lähde / Kohde

source: Choose a source and a target
fi: Valitse lähde ja kohde

source: Chord Diagram
fi: Jännediagrammi

source: Choose a number format
fi: Valitse numeromuoto

source: Source
fi: Lähde

source: Choose a source
fi: Valitse lähde

source: Target
fi: Kohde

source: Choose a target
fi: Valitse kohde

source: ISO 3166-2 codes of region/province/department
fi: Alueen/läänin/hallintoalueen ISO 3166-2 -koodit

source: It's ISO 3166-2 of your region/province/department in your table. (see documentation for list of ISO 3166-2)
fi: Taulussasi oleva ISO 3166-2 -koodi. Lista koodeista on luettavissa dokumentaatiossa.

source: Country Control
fi: Maa-hallinta

source: 3 letter code of the country
fi: Maan 3-kirjaiminen koodi

source: Metric for color
fi: Metriikka värille

source: Metric that defines the color of the country
fi: Maan värityksen määräävä metriikka

source: Bubble size
fi: Kuplan koko

source: Metric that defines the size of the bubble
fi: Kuplan koon määrittävä metriikka

source: Filter Box
fi: Suodatinlaatikko

source: Filter controls
fi: Suodatinvalinnat

source: The controls you want to filter on. Note that only columns checked as "filterable" will show up on this list.
fi: Valinnat joita haluat käyttää suodatukseen. Vain suodatettavaksi ("filterable") merkityt sarakkeet ovat käytettävissä.

source: Heatmap Options
fi: Lämpökartan valinnat

source: Value bounds
fi: Raja-arvot

source: Value Format
fi: Arvon muoto

source: Horizon
fi: Horisontti

source: Points
fi: Pisteet

source: Labelling
fi: Nimeäminen

source: Visual Tweaks
fi: Visuaaliset säädöt

source: Viewport
fi: Näkymä

source: Longitude
fi: Pituusaste

source: Column containing longitude data
fi: Sarake joka sisältää pituusasteen

source: Latitude
fi: Leveysaste

source: Column containing latitude data
fi: Sarake joka sisältää leveysasteen

source: Cluster label aggregator
fi: Ryhmänimien koontitoiminto

source: Aggregate function applied to the list of points in each cluster to produce the cluster label.
fi: Koontifunktio jota käytetään ryhmänimen sen sisältämien pisteiden perusteella.

source: Tooltip
fi: Työkaluvinkki

source: Show a tooltip when hovering over points and clusters describing the label
fi: Näytä työkaluvinkkit kun hiiri viedään pisteiden ja ryhmien päälle

source: Event definition
fi: Tapahtuman määrittely

source: Additional meta data
fi: Ylimääräinen metatieto

source: Column containing entity ids
fi: Sarake joka sisältää kokonaisuuksien ID:t

source: e.g., a "user id" column
fi: esim. käyttäjän tunnistenumero-sarake

source: Column containing event names
fi: Tapahtumanimet sisältävä sarake

source: Event count limit
fi: Rajoita tapahtumien määrää

source: The maximum number of events to return, equivalent to number of rows
fi: Suurin mahdollinen määrä palautettavia tapahtumia, yhtä kuin rivimäärä

source: Meta data
fi: Metatieto

source: Select any columns for meta data inspection
fi: Valitse mikä tahansa sarake metatiedon tarkasteluun

source: Paired t-test
fi: Paritettu t-testi

source: Time Series Options
fi: Aikajakson valinnat

source: The server could not be reached. You may want to verify your connection and try again.
fi: Palvelimeen ei saatu yhteyttä. Tarkista yhteytesi toiminta ja yritä uudelleen.

source: An unknown error occurred. (Status: %s )
fi: Tapahtui tuntematon virhe. (Tila: %s )

source: Favorites
fi: Suosikit

source: Created Content
fi: Luotu sisältö

source: Recent Activity
fi: Viimeisimmät toiminnot

source: Security & Access
fi: Turvallisuus ja pääsynhallinta

source: No slices
fi: Ei siivuja

source: No dashboards
fi: Ei infotauluja

source: Dashboards
fi: Infotaulut

source: No favorite slices yet, go click on stars!
fi: Ei siivuja suosikeissa, menehän klikkailemaan tähtiä!

source: No favorite dashboards yet, go click on stars!
fi: Ei infotauluja suosikeissa, menehän klikkailemaan tähtiä!

source: Roles
fi: Roolit

source: Databases
fi: Tietokannat

source: Datasources
fi: Tietolähteet

source: Profile picture provided by Gravatar
fi: Profiilikuvan tarjoaa Gravatar

source: joined
fi: liittynyt

source: Sorry, there appears to be no data
fi: Pahoittelut, näyttää siltä että yhtään tietoa ei ole olemassa

source: Select [%s]
fi: Valitse [%s]

source: No data was returned.
fi: Tietoa ei palautunut

source: List Druid Column
fi: Listaa Druid-sarakkeet

source: Show Druid Column
fi: Näytä Druid-sarake

source: Add Druid Column
fi: Lisää Druid-sarake

source: Edit Druid Column
fi: Muokkaa Druid-saraketta

source: Column
fi: Sarake

source: Type
fi: Tyyppi

source: Groupable
fi: Ryhmiteltävä

source: Filterable
fi: Suodatettava

source: Count Distinct
fi: Erillisarvojen lukumäärä

source: Sum
fi: Summa

source: Whether this column is exposed in the `Filters` section of the explore view.
fi: Näytetäänkö tämä sarake tarkastelunäkymän `Suodattimet` -osiossa

source: List Druid Metric
fi: Listaa Druid-metriikat

source: Show Druid Metric
fi: Näytä Druid-metriikka

source: Add Druid Metric
fi: Lisää Druid-metriikka

source: Edit Druid Metric
fi: Muokkaa Druid-metriikkaa

source: Whether the access to this metric is restricted to certain roles. Only roles with the permission 'metric access on XXX (the name of this metric)' are allowed to access this metric
fi: Rajataanko tähän metriikkaan pääsy tietyille rooleille. Vain roolit joilla on oikeus 'metric access on XXX' (jossa tämän metriikan nimi) voivat käyttää tätä metriikkaa

source: Verbose Name
fi: Selkokielinen nimi

source: Druid Datasource
fi: Druid-tietolähde

source: Warning Message
fi: Varoitusviesti

source: List Druid Cluster
fi: Listaa Druid-klusterit

source: Show Druid Cluster
fi: Näytä Druid-klusteri

source: Add Druid Cluster
fi: Lisää Druid-klusteri

source: Edit Druid Cluster
fi: Muokkaa Druid-klusteria

source: Cluster
fi: Klusteri

source: Coordinator Host
fi: Coordinator-palvelin

source: Coordinator Port
fi: Coordinator-portti

source: Coordinator Endpoint
fi: Coordinator-päätepiste

source: Broker Host
fi: Broker-palvelin

source: Broker Port
fi: Broker-portti

source: Broker Endpoint
fi: Broker-päätepiste

source: Druid Clusters
fi: Druid-klusterit

source: Sources
fi: Lähteet

source: List Druid Datasource
fi: Listaa Druid-tietolähteet

source: Show Druid Datasource
fi: Näytä Druid-tietolähde

source: Add Druid Datasource
fi: Lisää Druid-tietolähde

source: Edit Druid Datasource
fi: Muokkaa Druid-tietolähdettä

source: The list of slices associated with this table. By altering this datasource, you may change how these associated slices behave. Also note that slices need to point to a datasource, so this form will fail at saving if removing slices from a datasource. If you want to change the datasource for a slice, overwrite the slice from the 'explore view'
fi: Lista siivuista jotka ovat liitettynä tähän tauluun. Tätä lähdettä muokkaamalla voit muuttaa liittyvien siivujen toimintaa. Huomaa, että kunkin siivun täytyy liittyä johonkin datalähteeseen, joten tämän lomakkeen tallennus ei onnistu jos poistat siivun linkityksen datalähteeseen. Jos haluat vaihtaa siivun datalähdettä, ylikirjoita siivu 'tarkastelunäkymästä'

source: Timezone offset (in hours) for this datasource
fi: Aikavyöhykkeen erotus (tunteina) tälle tietolähteelle

source: Associated Slices
fi: Tähän liittyvät siivut

source: Data Source
fi: Tietolähde

source: Owner
fi: Omistaja

source: Is Hidden
fi: On piilotettu

source: Enable Filter Select
fi: Mahdollista suodattimen valinta

source: Default Endpoint
fi: Oletuspäätepiste

source: Time Offset
fi: Aikaerotus

source: Cache Timeout
fi: Välimuistin aikaraja

source: Druid Datasources
fi: Druid-datalähteet

source: Scan New Datasources
fi: Skannaa uusia datalähteitä

source: Refresh Druid Metadata
fi: Päivitä Druid-metatiedot

source: Datetime column not provided as part table configuration and is required by this type of chart
fi: Taulussa ei ole aikasaraketta (Datetime) mutta se vaaditaan tämän tyyppisessä kaaviossa"

source: Empty query?
fi: Tyhjä kysely?

source: Metric '{}' is not valid
fi: Metriikka '{}' ei ole kelvollinen
