Repository: habalux/incubator-superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: fi

source: Time Column
fi: Aikasarake

source: second
fi: sekunti

source: minute
fi: minuutti

source: hour
fi: tunti

source: day
fi: päivä

source: week
fi: viikko

source: month
fi: kuukausi

source: quarter
fi: neljännes

source: year
fi: vuosi

source: 5 minute
fi: 5 minuuttia

source: half hour
fi: puoli tuntia

source: 10 minute
fi: 10 minuuttia

source: [Superset] Access to the datasource %(name)s was granted
fi: [Superset] Käyttöoikeus datalähteeseen %(name)s on myönnetty

source: Viz is missing a datasource
fi: Viz:illä ei ole datalähdettä

source: From date cannot be larger than to date
fi: Alkupäivä täytyy olla ennen loppupäivää

source: Table View
fi: Taulukkonäkymä

source: Pick a granularity in the Time section or uncheck 'Include Time'
fi: Valitse rakeisuus Aika-osiosta tai poista valinta 'Sisällytä aika'

source: Time Table View
fi: Aikataulunäkymä

source: Pick at least one metric
fi: Valitse vähintään yksi metriikka

source: When using 'Group By' you are limited to use a single metric
fi: Kun käytössä on 'Group By', voit valita vain yhden metriikan

source: Pivot Table
fi: Pivot-Taulu

source: Please choose at least one "Group by" field
fi: Valitse vähintään yksi 'Group By' -kenttä

source: Please choose at least one metric
fi: Valitse vähintään yksi metriikka

source: 'Group By' and 'Columns' can't overlap
fi: 'Group By' ja 'Columns' eivät voi olla päällekkäisiä

source: Markup
fi: Merkintä

source: Separator
fi: Erotin

source: Word Cloud
fi: Sanapilvi

source: Treemap
fi: Puukartta

source: Box Plot
fi: Laatikkokaavio

source: Bubble Chart
fi: Kuplakaavio

source: Pick a metric to display
fi: Valitse näytettävä metriikka

source: Big Number with Trendline
fi: Iso Numero kuvaajalla

source: Pick a metric!
fi: Valitse metriikka!

source: Big Number
fi: Iso Numero

source: Time Series - Line Chart
fi: Aikajana - Viivakaavio

source: Pick a time granularity for your time series
fi: Valitse rakeisuus aikasarjalle

source: Time Series - Dual Axis Line Chart
fi: Aikajana - Kaksoisakselinen viivakaavio

source: Pick a metric for left axis!
fi: Valitse metriikka vasemmalle akselille!

source: Pick a metric for right axis!
fi: Valitse metriikka oikealle akselille!

source: Please choose different metrics on left and right axis
fi: Ole hyvä ja valitse eri metriikat vasemman ja oikean puolen akseleille

source: Time Series - Bar Chart
fi: Aikajana - Palkkikaavio

source: Time Series - Percent Change
fi: Aikajana - Muutosprosentti

source: Time Series - Stacked
fi: Aikajana - Pinottu

source: Distribution - NVD3 - Pie Chart
fi: Jakauma - NVD3 - Piirakkakaavio

source: Histogram
fi: Histogrammi

source: Must have one numeric column specified
fi: Vähintään yksi numeerinen sarake vaaditaan

source: Distribution - Bar Chart
fi: Jakauma - Palkkikaavio

source: Pick exactly 2 columns as [Source / Target]
fi: Valitse täsmälleen kaksi saraketta [Lähde / Kohde]

source: Pick exactly 2 columns to 'Group By'
fi: Valitse tasan kaksi 'Group By' -saraketta

source: Country Map
fi: Maa-kartta

source: World Map
fi: Maailman kartta

source: Filters
fi: Suotimet

source: Pick at least one filter field
fi: Valitse vähintään yksi suodatettava kenttä

source: Parallel Coordinates
fi: Rinnakkaiset koordinaatit

source: Heatmap
fi: Lämpökartta

source: Partition Diagram
fi: Osiodiagrammi

source: Your query was saved
fi: Kyselysi tallennettiin

source: Your query could not be saved
fi: Kyselyä ei voitu tallentaa

source: Could not connect to server
fi: Ei voitu yhdistää palvelimeen

source: Your session timed out, please refresh your page and try again.
fi: Istuntosi on vanhentunut, ole hyvä ja päivitä sivu yrittääksesi uudelleen

source: Query was stopped.
fi: Kysely pysäytettiin

source: Failed at stopping query.
fi: Kyselyn pysäytys ei onnistunut

source: Error occurred while fetching table metadata
fi: Taulun tietojen haku epäonnistui

source: shared query
fi: jaettu kysely

source: The query couldn't be loaded
fi: Kyselyä ei voitu ladata

source: An error occurred while creating the data source
fi: Datalähdettä ei voitu luoda virheen vuoksi

source: Pick a chart type!
fi: Valitse kaavion tyyppi!

source: To use this chart type you need at least one column flagged as a date
fi: Tämä kaavio vaatii vähintään yhden aikasarakkeen

source: To use this chart type you need at least one dimension
fi: Tämä kaavio vaatii vähintään yhden ulottuvuuden

source: To use this chart type you need at least one aggregation function
fi: Tämä kaavio vaatii vähintään yhden koontifunktion

source: Untitled Query
fi: Nimetön kysely

source: Copy of %s
fi: Kopio - %s

source: share query
fi: jaa kysely

source: copy URL to clipboard
fi: kopioi URL leikepöydälle

source: Raw SQL
fi: Suora SQL

source: Source SQL
fi: SQL-lähde

source: No query history yet...
fi: Kyselyhistoriaa ei vielä ole...

source: It seems you don't have access to any database
fi: Sinulla ei näytä olevan käyttöoikeutta yhteenkään tietokantaan

source: Search Results
fi: Hakutulokset

source: Search
fi: Haku

source: Open in SQL Editor
fi: Avaa SQL-editorissa

source: view results
fi: näytä tulokset

source: Data preview
fi: Tietojen esikatselu

source: Visualize the data out of this query
fi: Visualisoi tämän kyselyn tulokset

source: Overwrite text in editor with a query on this table
fi: Ylikirjoita muokattavana oleva teksti kyselyllä tähän tauluun

source: Run query in a new tab
fi: Aja kysely uudessa välilehdessä

source: Remove query from log
fi: Poista kysely lokista

source: Visualize
fi: Visualisoi

source: Table
fi: Taulu

source: Fetch data preview
fi: Hae tietojen esikatselu

source: Track Job
fi: Seuraa työtä

source: Loading...
fi: Lataa...

source: Run Selected Query
fi: Aja valittu kysely

source: Run Query
fi: Aja kysely

source: Run query asynchronously
fi: Aja kysely asynkronisesti

source: Stop
fi: Pysäytä

source: Undefined
fi: Määrittelemätön

source: Label
fi: Nimitys

source: Label for your query
fi: Nimitys kyselyllesi

source: Description
fi: Kuvaus

source: Write a description for your query
fi: Kirjoita kuvaus kyselyllesi

source: Save
fi: Tallenna

source: Cancel
fi: Peruuta

source: Save Query
fi: Tallenna kysely

source: Run a query to display results here
fi: Aja kysely näyttääksesi tulokset tässä

source: Preview for %s
fi: Esikatselu - %s

source: Results
fi: Tulokset

source: Query History
fi: Kyselyhistoria

source: Create table as with query results
fi: Luo uusi taulu kyselyn tuloksista

source: new table name
fi: uuden taulun nimi

source: Error while fetching table list
fi: Virhe haettaessa listaa tauluista

source: Error while fetching schema list
fi: Virhe haettaessa listaa schemoista

source: Error while fetching database list
fi: Virhe haettaessa listaa tietokannoista

source: Database:
fi: Tietokanta:

source: Select a database
fi: Valitse tietokanta

source: Select a schema (%s)
fi: Valitse schema (%s)

source: Add a table (%s)
fi: Lisää taulu (%s)

source: Type to search ...
fi: Kirjoita hakuehto ...

source: Reset State
fi: Nollaa tila

source: Enter a new title for the tab
fi: Anna uusi otsikko välilehdelle

source: Untitled Query %s
fi: Nimetön kysely %s

source: close tab
fi: sulje välilehti

source: rename tab
fi: nimeä välilehti

source: expand tool bar
fi: laajenna työkaluvalikko

source: hide tool bar
fi: piilota työkaluvalikko

source: Copy partition query to clipboard
fi: Kopioi osiokysely leikepöydälle

source: latest partition:
fi: uusin osio:

source: Keys for table
fi: Avaimet taululle

source: View keys & indexes (%s)
fi: Näytä avaimet ja indeksit (%s)

source: Sort columns alphabetically
fi: Lajittele sarakkeet aakkosjärjestyksessä

source: Original table column order
fi: Taulun alkuperäinen sarakejärjestys

source: Copy SELECT statement to clipboard
fi: Kopioi SELECT-lause leikepöydälle

source: Remove table preview
fi: Poista taulun esikatselu

source: %s is not right as a column name, please alias it (as in SELECT count(*)
fi: %s ei ole kelvollinen nimi sarakkeelle, ole hyvä ja tee siitä alias (niikuin SELECT count(*)

source: using only alphanumeric characters and underscores
fi: käyttäen vain alfanumeerisia merkkejä ja alaviivaa

source: Creating a data source and popping a new tab
fi: Uuden datalähteen luonti ja välilehden avaaminen

source: No results available for this query
fi: Ei tuloksia tälle kyselylle

source: Chart Type
fi: Kaavion tyyppi

source: [Chart Type]
fi: [Kaavion tyyppi]

source: Datasource Name
fi: Tietolähteen nimi

source: datasource name
fi: tietolähteen nimi

source: Create a new slice
fi: Luo uusi siivu

source: Choose a datasource
fi: Valitse tietolähde

source: Choose a visualization type
fi: Valitse visualisoinnin tyyppi

source: Create new slice
fi: Luo uusi siivu

source: Select ...
fi: Valitse ...

source: Loaded data cached
fi: Tiedot ladattu välimuistiin

source: Loaded from cache
fi: Tiedot ladattu välimuistista

source: Click to force-refresh
fi: Klikkaa pakottaaksesi päivitys

source: Copy to clipboard
fi: Kopioi leikepöydälle

source: Not successful
fi: Epäonnistunut

source: Sorry, your browser does not support copying. Use Ctrl / Cmd + C!
fi: Valitettavasti selaimesi ei tue kopiointia. Käytä Ctrl + C tai Cmd + C!

source: Copied!
fi: Kopioitu!

source: Title
fi: Otsikko

source: click to edit title
fi: klikkaa muokataksesi otsikkoa

source: You don't have the rights to alter this title.
fi: Sinulla ei ole oikeuksia muokata tätä otsikkoa

source: Click to favorite/unfavorite
fi: Klikkaa suosikiksi/pois suosikeista

source: You have unsaved changes.
fi: Sinulla on tallentamattomia muutoksia

source: Click the
fi: Klikkaa

source: button on the top right to save your changes.
fi: painiketta yläoikealla tallentaaksesi muutokset.

source: Served from data cached %s . Click to force refresh.
fi: Haettu välimuistista joka on päivittynyt %s . Klikkaa pakottaaksesi uudelleenpäivitys.

source: Click to force refresh
fi: Klikkaa pakottaaksesi uudelleenpäivitys

source: Error
fi: Virhe

source: Sorry, there was an error adding slices to this dashboard: %s
fi: Valitettavasti siivun lisääminen infotauluun ei onnistunut: %s

source: Active Dashboard Filters
fi: Aktiiviset infotaulun suodattimet

source: Force refresh the whole dashboard
fi: Pakota päivitys koko infotaululle

source: Edit this dashboard's properties
fi: Muokkaa infotaulun ominaisuuksia

source: Load a template
fi: Lataa malli

source: Load a CSS template
fi: Lataa CSS-malli

source: Live CSS Editor
fi: Reaaliaikainen CSS-editori

source: Don't refresh
fi: Älä päivitä

source: 10 seconds
fi: 10 sekuntia

source: 30 seconds
fi: 30 sekuntia

source: 1 minute
fi: 1 minuutti

source: 5 minutes
fi: 5 minuuttia

source: Refresh Interval
fi: Päivitysväli

source: Choose the refresh frequency for this dashboard
fi: Valitse päivitystaajuus tälle infotaululle

source: This dashboard was saved successfully.
fi: Infotaulu tallennettiin onnistuneesti.

source: Sorry, there was an error saving this dashboard:
fi: Infotaulua ei voitu tallentaa:

source: You must pick a name for the new dashboard
fi: Anna uusi nimi infotaululle

source: Save Dashboard
fi: Tallenna infotaulu

source: Overwrite Dashboard [%s]
fi: Ylikirjoita infotaulu [%s]

source: Save as:
fi: Tallenna nimellä:

source: [dashboard name]
fi: [infotaulun nimi]

source: Name
fi: Nimi

source: Modified
fi: Muokattu

source: Add Slices
fi: Lisää siivuja

source: Add a new slice to the dashboard
fi: Lisää siivu infotaululle

source: Add Slices to Dashboard
fi: Lisää siivuja infotaululle

source: Move chart
fi: Siirrä kaaviota

source: Force refresh data
fi: Pakota tietojen päivitys

source: Toggle chart description
fi: Näytä/piilota kaavion kuvaus

source: Edit chart
fi: Muokkaa kaaviota

source: Export CSV
fi: Vie CSV

source: Explore chart
fi: Tutki kaaviota

source: Remove chart from dashboard
fi: Poista kaavio infotaululta

source: is expected to be a number
fi: täytyy olla numero

source: is expected to be an integer
fi: täytyy olla kokonaisluku

source: cannot be empty
fi: ei voi olla tyhjä

source: %s - untitled
fi: %s - nimetön

source: Edit slice properties
fi: Muokkaa siivun ominaisuuksia

source: description
fi: kuvaus

source: bolt
fi: pultti

source: Changing this control takes effect instantly
fi: Tämän muuttamisella on välitön vaikutus

source: Error...
fi: Virhe...

source: Query
fi: Kysely

source: Height
fi: Korkeus

source: Width
fi: Leveys

source: Export to .json
fi: Vie .json

source: Export to .csv format
fi: Vie .csv-muodossa

source: Please enter a slice name
fi: Anna siivun nimi

source: Please select a dashboard
fi: Valitse infotaulu

source: Please enter a dashboard name
fi: Anna infotaulun nimi

source: Save A Slice
fi: Tallenna siivu

source: Overwrite slice %s
fi: Ylikirjoita siivu %s

source: Save as
fi: Tallenna nimellä

source: [slice name]
fi: [siivun nimi]

source: Do not add to a dashboard
fi: Älä lisää infotauluun

source: Add slice to existing dashboard
fi: Lisää siivu olemassa olevaan infotauluun

source: Add to new dashboard
fi: Lisää uuteen infotauluun

source: Save & go to dashboard
fi: Tallenna ja siirry infotauluun

source: `Min` value should be numeric or empty
fi: `Min` -arvo täytyy olla numeerinen tai tyhjä

source: `Max` value should be numeric or empty
fi: `Max` -arvo täytyy olla numeerinen tai tyhjä

source: Min
fi: Minimi

source: Max
fi: Maksimi

source: Something went wrong while fetching the datasource list
fi: Jotain meni pieleen haettaessa tietolähteitä

source: Click to point to another datasource
fi: Klikkaa vaihtaaksesi tietolähdettä

source: Edit the datasource's configuration
fi: Muokkaa tietolähteen asetuksia

source: Select a datasource
fi: Valitse tietolähde

source: Search / Filter
fi: Hae / Suodata

source: Filter value
fi: Suodattimen arvo

source: Select metric
fi: Valitse metriikka

source: Select column
fi: Valitse sarake

source: Select operator
fi: Valitse operaattori

source: Add Filter
fi: Lisää suodatin

source: Error while fetching data
fi: Virhe haettaessa tietoja

source: Select %s
fi: Valitse %s

source: Edit
fi: Muokkaa

source: Select a visualization type
fi: Valitse visualisointityyppi

source: Updating chart was stopped
fi: Kaavion päivitys pysähtyi

source: An error occurred while rendering the visualization: %s
fi: Visualisointi pysähtyi virheeseen: %s

source: Perhaps your data has grown, your database is under unusual load, or you are simply querying a data source that is to large to be processed within the timeout range. If that is the case, we recommend that you summarize your data further.
fi: Ehkä tietomäärä on kasvanut, tietokanta on tavallista suuremmankuormituksen alaisena tai olet hakemassa liian suurta tietomäärää jota eivoida käsitellä aikarajan sisällä. Siinä tapauksesssa suosittelemme ettämuokkaat hakua niin että sen tuloksiin sovelletaan enemmän yhteenvetoa.

source: Network error.
fi: Verkkovirhe.

source: A reference to the [Time] configuration, taking granularity into account
fi: Viittaus [Aika] -asetukseen, joka ottaa huomioon jaksotuksen

source: Group by
fi: Ryhmittely

source: One or many controls to group by
fi: Yksi tai useampi ryhmittelyvalinta

source: Datasource
fi: Tietolähde

source: Visualization Type
fi: Visualisointityyppi

source: The type of visualization to display
fi: Näytettävän visualisoinnin tyyppi

source: Metrics
fi: Metriikat

source: One or many metrics to display
fi: Yksi tai useampi näytettävä metriikka

source: Percentage Metrics
fi: Prosenttimetriikka

source: Y Axis Bounds
fi: Y-akselin rajat

source: Bounds for the Y axis. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
fi: Rajat Y-akselille. Jos tämä on tyhjä, rajat määritetään automaattisestitietojen maksimi- ja minimiarvojen mukaan. Tämä asetus voi ainoastaan laajentaa aluetta, ei pienentää sitä.

source: Ordering
fi: Järjestys

source: Metric
fi: Metriikka

source: Choose the metric
fi: Valitse metriikka

source: Right Axis Metric
fi: Oikean akselin metriikka

source: Choose a metric for right axis
fi: Valitse metriikka oikeanpuoleiselle akselille

source: Stacked Style
fi: Pinottu tyyli

source: Sort X Axis
fi: Järjestä X-akseli

source: Sort Y Axis
fi: Järjestä Y-akseli

source: Linear Color Scheme
fi: Lineaarinen värikartta

source: Normalize Across
fi: Normalisoi käyttäen

source: Horizon Color Scale
fi: Horisontin väriskaala

source: Defines how the color are attributed.
fi: Määrittää miten värit johdetaan

source: Rendering
fi: Esitys

source: XScale Interval
fi: X-akselin skaalausintervalli

source: Number of steps to take between ticks when displaying the X scale
fi: Kuinka monta askelta tikkien välissä X-akselilla

source: YScale Interval
fi: Y-akselin skaalausintervalli

source: Number of steps to take between ticks when displaying the Y scale
fi: Kuinka monta askelta tikkien välillä Y-akselilla

source: Include Time
fi: Näytä aika

source: Whether to include the time granularity as defined in the time section
fi: Näytetäänkö aikarakeisuus niinkuin määritelty aika-osiossa

source: Show percentage
fi: Näytä prosentit

source: Whether to include the percentage in the tooltip
fi: Näytetäänkö prosentit työkaluvinkissä

source: Stacked Bars
fi: Pinotut palkit

source: Show totals
fi: Näytä summat

source: Display total row/column
fi: Näytä rivi/sarakesummat

source: Show Markers
fi: Näytä merkit

source: Show data points as circle markers on the lines
fi: Näytä datapisteet ympyröinä viivoilla

source: Bar Values
fi: Palkkien arvot

source: Show the value on top of the bar
fi: Näytä arvo palkin yläosassa

source: Sort Bars
fi: Järjestä palkit

source: Sort bars by x labels.
fi: Järjestä palkit X-merkinnän mukaan

source: Combine Metrics
fi: Yhdistä metriikat

source: Display metrics side by side within each column, as opposed to each column being displayed side by side for each metric.
fi: Näytä metriikat vierekkäin sarakkeessa, eikä niin että jokasarakkeet näytetään vierekkäin.

source: Extra Controls
fi: Lisävalinnat

source: Whether to show extra controls or not. Extra controls include things like making mulitBar charts stacked or side by side.
fi: Määrittää näytetäänkö lisävalinnat. Lisävalintoja ovat esim. monipalkkikaavioiden näyttäminen pinottuna tai vierekkäin.

source: Reduce X ticks
fi: Vähennä X-tikkejä

source: Reduces the number of X axis ticks to be rendered. If true, the x axis wont overflow and labels may be missing. If false, a minimum width will be applied to columns and the width may overflow into an horizontal scroll.
fi: Pienentää X-akselin tikkien määrää. Jos asetettu, X-akseli ei voi ylivuotaa ja merkintöjä voi jäädä pois. Jos ei asetettu, sarakkeelle määrätään vähimmäisleveys ja se voi ylivuotaa vaakatasoiseksi vieritykseksi.

source: Include Series
fi: Sisällytä sarja

source: Include series name as an axis
fi: Sisällytä sarjan nimi akselina

source: Color Metric
fi: Värimetriikka

source: A metric to use for color
fi: Metriikka joka määrää värin

source: Country Name
fi: Maan nimi

source: The name of country that Superset should display
fi: Maan nimi joka tulee näyttää

source: Country Field Type
fi: Maa-kentän tyyppi

source: The country code standard that Superset should expect to find in the [country] column
fi: Maakoodistandardi jota käytetään [maa] -sarakkeessa

source: Columns
fi: Sarakkeet

source: One or many controls to pivot as columns
fi: Yksi tai useampi valinta jotka pivotoidaan sarakkeiksi

source: Columns to display
fi: Näytettävät sarakkeet

source: Origin
fi: Alkuperä

source: Defines the origin where time buckets start, accepts natural dates as in `now`, `sunday` or `1970-01-01`
fi: Määrittää alkuhetken josta aikasaavit alkavat, voi ottaa luonnollisen päivämäärän (englanniksi) kuten `now`, `sunday` tai `1970-01-01`

source: Bottom Margin
fi: Alamarginaali

source: Bottom margin, in pixels, allowing for more room for axis labels
fi: Alamarginaali pikseleinä, jos haluat lisätilaa akseleiden nimille

source: Left Margin
fi: Vasen marginaali

source: Left margin, in pixels, allowing for more room for axis labels
fi: Vasen marginaali pikseleinä, jos haluat lisätilaa akseleiden nimille

source: Time Granularity
fi: Aikarakeisuus

source: The time granularity for the visualization. Note that you can type and use simple natural language as in `10 seconds`, `1 day` or `56 weeks`
fi: Visualisoinnin aikarakeisuus. Voit käyttää myös yksinkertaisia (englanninkielisiä) sanoja kuten `10 seconds`, `1 day` tai `56 weeks`

source: Domain
fi: Alue

source: Subdomain
fi: Alialue

source: The time unit for each block. Should be a smaller unit than domain_granularity. Should be larger or equal to Time Grain
fi: Aikayksikkö kullekin lohkolle. Tulee olla pienempi kuin domain_granularity. Tulee olla suurempi tai yhtäsuuri kuin valittu aikarakeisuus

source: Link Length
fi: Linkin pituus

source: Link length in the force layout
fi: Linkin pituus voima-asettelussa

source: Charge
fi: Varaus

source: Charge in the force layout
fi: Varaus voima-asettelussa

source: Time Grain
fi: Aikarakeisuus

source: Resample Rule
fi: Uudelleenotantasääntö

source: Pandas resample rule
fi: Pandas uudelleenotantasääntö

source: Resample How
fi: Uudelleenotantamenetelmä

source: Pandas resample how
fi: Pandas uudelleenotantamenetelmä

source: Resample Fill Method
fi: Uudelleenotannan täyttömenetelmä

source: Pandas resample fill method
fi: Pandas uudelleenotannan täyttömenetelmä

source: Since
fi: Alkaen

source: 7 days ago
fi: 7 päivää sitten

source: Until
fi: Asti

source: Max Bubble Size
fi: Kuplan maksimikoko

source: Ratio
fi: Suhde

source: Target aspect ratio for treemap tiles.
fi: Tavoitesuhde puukartan tiilille

source: Number format
fi: Lukumuoto

source: Row limit
fi: Rivimäärän rajoitus

source: Series limit
fi: Sarjan rajoitus

source: Limits the number of time series that get displayed
fi: Rajoittaa kuinka monta aikasarjaa näytetään

source: Sort By
fi: Lajittele

source: Sort Descending
fi: Lajittele laskevasti

source: Whether to sort descending or ascending
fi: Lajitellaanko laskevasti vai nousevasti

source: Rolling
fi: Rullaava

source: Defines a rolling window function to apply, works along with the [Periods] text box
fi: Määrittää käyttöön rullaavan window-funktion, joka toimii [Jaksot] tekstilaatikon kanssa

source: Periods
fi: Jaksot

source: Defines the size of the rolling window function, relative to the time granularity selected
fi: Määrittää rullaavan ikkunafunktion koon, suhteessa määritettyyn aikarakeisuuteen

source: Min Periods
fi: Jaksoja vähintään

source: The minimum number of rolling periods required to show a value. For instance if you do a cumulative sum on 7 days you may want your "Min Period" to be 7, so that all data points shown are the total of 7 periods. This will hide the "ramp up" taking place over the first 7 periods
fi: Pienin määrä rullausjaksoja joka vaaditaan arvon näyttämiseksi. Jos otat kumulatiivisen summan 7 päivän ajalta, saatat haluta asettaa jaksojen vähimmäismääräksi 7, jotta kaikki näytteet otetaan samalta jaksolta. Tämä piilottaa alussa olevan "käynnistysvaiheen" 7 jakson ajalta

source: Series
fi: Sarja

source: Defines the grouping of entities. Each series is shown as a specific color on the chart and has a legend toggle
fi: Määrittää kokonaisuuksien ryhmittelyn. Jokainen sarja näytetään omalla värillään kaaviossa jossa sen näkyvyyttä voi muuttaa.

source: Entity
fi: Kokonaisuus

source: This defines the element to be plotted on the chart
fi: Tämä määrittää elementin joka piirretään kaaviolle

source: X Axis
fi: X-akseli

source: Metric assigned to the [X] axis
fi: X-akseliin määrätty metriikka

source: Y Axis
fi: Y-akseli

source: Metric assigned to the [Y] axis
fi: Y-akseliin määrätty metriikka
