Repository: habalux/incubator-superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: fi

source: Table [{}] doesn't seem to exist in the specified database, couldn't fetch column information
fi: Taulua [{}] ei näytä olevan olemassa kyseisessä tietokannassa, ei voitu hakea saraketietoja

source: List Columns
fi: Listaa sarakkeet

source: Show Column
fi: Näytä sarake

source: Add Column
fi: Lisää sarake

source: Edit Column
fi: Muokkaa saraketta

source: Whether to make this column available as a [Time Granularity] option, column has to be DATETIME or DATETIME-like
fi: Onko tämä sarake saatavilla [Aikarakeisuus] -valintana. Sarakkeen tyyppi täytyy olla DATETIME tai sitä vastaava

source: The data type that was inferred by the database. It may be necessary to input a type manually for expression-defined columns in some cases. In most case users should not need to alter this.
fi: Tietokannan ilmoittama sarakkeen tyyppi. Tyypin voi joissakin tapauksissa joutua syöttämään manuaalisesti jos kyseessä on lausekkeen määrittämä sarake. Tätä ei yleensä tarvitse määrittää itse.

source: Expression
fi: Lauseke

source: Is temporal
fi: Aikasarake

source: Datetime Format
fi: Päivämäärän ja ajan muoto

source: Database Expression
fi: Tietokannan lauseke

source: List Metrics
fi: Listaa metriikat

source: Show Metric
fi: Näytä metriikka

source: Add Metric
fi: Lisää metriikka

source: Edit Metric
fi: Muokkaa metriikkaa

source: SQL Expression
fi: SQL-lauseke

source: D3 Format
fi: D3-muoto

source: Is Restricted
fi: On rajoitettu

source: List Tables
fi: Listaa taulut

source: Show Table
fi: Näytä taulu

source: Add Table
fi: Lisää taulu

source: Edit Table
fi: Muokkaa taulua

source: Name of the table that exists in the source database
fi: Lähdetietokannassa sijaitsevan taulun nimi

source: Schema, as used only in some databases like Postgres, Redshift and DB2
fi: Schema, jota käytetään vain tietyissä tietokannoissa kuten PostgreSQL, Redshift ja DB2

source: Changed By
fi: Muokannut

source: Database
fi: Tietokanta

source: Last Changed
fi: Viimeksi muokattu

source: Offset
fi: Erotus

source: Table Name
fi: Taulun nimi

source: Main Datetime Column
fi: Ensisijainen aikasarake

source: Table [{}] could not be found, please double check your database connection, schema, and table name
fi: Taulua [{}] ei löytynyt, ole hyvä ja tarkista yhteytesi, schema sekä taulun nimi

source: The table was created. As part of this two phase configuration process, you should now click the edit button by the new table to configure it.
fi: Uusi taulu luotiin. Määritysprosessi on kaksivaiheinen, joten seuraavaksi sinun täytyy klikata muokkausnappia ja päivittää taulun ominaisuudet.

source: Refresh Metadata
fi: Päivitä metatiedot

source: Refresh column metadata
fi: Päivitä sarakkeen metatiedot

source: Metadata refreshed for the following table(s): %(tables)s
fi: Metatiedot päivitettiin seuraaville tauluille: %(tables)s

source: Tables
fi: Taulut

source: Profile
fi: Profiili

source: Logout
fi: Kirjaudu ulos

source: Login
fi: Kirjaudu sisään

source: Record Count
fi: Rivimäärä

source: No records found
fi: Rivejä ei löytynyt

source: Import
fi: Tuo

source: No Access!
fi: Ei käyttöoikeutta!

source: You do not have permissions to access the datasource(s): %(name)s.
fi: Sinulla ei ole oikeutta käyttää näitä tietolähteitä: %(name)s.

source: Request Permissions
fi: Pyydä käyttöoikeutta

source: Welcome!
fi: Tervetuloa!

source: Test Connection
fi: Testaa yhteyttä

source: Manage
fi: Hallitse

source: Datasource %(name)s already exists
fi: Tietolähdeä nimeltä %(name)s on jo olemassa

source: json isn't valid
fi: json ei ole kelvollinen

source: Delete
fi: Poista

source: Delete all Really?
fi: Poista varmasti kaikki?

source: This endpoint requires the `all_datasource_access` permission
fi: Tämä päätepiste vaatii oikeuden `all_datasource_access`

source: The datasource seems to have been deleted
fi: Tietolähde näyttäisi olevan poistettu

source: The access requests seem to have been deleted
fi: Käyttöoikeuspyyntö näyttäisi olevan poistettu

source: The user seems to have been deleted
fi: Käyttäjä näyttäisi olevan poistettu

source: You don't have access to this datasource
fi: Sinulla ei ole oikeutta tähän tietolähteeseen

source: This view requires the database %(name)s or `all_datasource_access` permission
fi: Tämä näkymä vaatii oikeuden tietokantaan %(name)s tai oikeuden `all_datasource_access`

source: This endpoint requires the datasource %(name)s, database or `all_datasource_access` permission
fi: Tämä päätepiste vaatii oikeuden datalähteeseen %(name)s, tietokantaan tai oikeuden `all_datasource_access`

source: List Databases
fi: Listaa tietokannat

source: Show Database
fi: Näytä tietokanta

source: Add Database
fi: Lisää tietokanta

source: Edit Database
fi: Muokkaa tietokantaa

source: Expose this DB in SQL Lab
fi: Näytä tämä tietokanta SQL Labissa

source: Allow users to run synchronous queries, this is the default and should work well for queries that can be executed within a web request scope (<~1 minute)
fi: Salli käyttäjien ajaa synkronisia kyselyitä. Tämä on oletusasetus ja todennäköisesti toimii hyvin kyselyille jotka voidaan suorittaa web-pyynnön aikana (<~1 minuuttia)

source: Allow users to run queries, against an async backend. This assumes that you have a Celery worker setup as well as a results backend.
fi: Salli käyttäjien ajaa kyselyitä asynkronisesti. Tämä olettaa, että olet ottanut käyttöön Celery-workerit sekä tulosten tallennusjärjestelmän (results backend).

source: Allow CREATE TABLE AS option in SQL Lab
fi: Salli CREATE TABLE AS -valinta SQL Labissa

source: Allow users to run non-SELECT statements (UPDATE, DELETE, CREATE, ...) in SQL Lab
fi: Salli käyttäjien ajaa SQL Labissa muitakin kuin SELECT-lauseita (UPDATE, DELETE, CREATE, ...)

source: When allowing CREATE TABLE AS option in SQL Lab, this option forces the table to be created in this schema
fi: Kun CREATE TABLE AS -valinta on sallittu, SQL Labissa, tämä asetus pakottaa taulut haluttuun schemaan

source: Expose in SQL Lab
fi: Näytä SQL Labissa

source: Allow CREATE TABLE AS
fi: Salli CREATE TABLE AS

source: Allow DML
fi: Salli DML

source: Creator
fi: Luonut

source: Allow Run Sync
fi: Salli synkroniset kyselyt

source: Allow Run Async
fi: Salli asynkroniset kyselyt

source: Import Dashboards
fi: Tuo infotauluja

source: User
fi: Käyttäjä

source: User Roles
fi: Roolit

source: Database URL
fi: Tietokannan URL

source: Roles to grant
fi: Myönnettävät roolit

source: Created On
fi: Luontiaika

source: Access requests
fi: Käyttöoikeuspyynnöt

source: Security
fi: Turvallisuus

source: List Slices
fi: Listaa siivut

source: Show Slice
fi: Näytä siivu

source: Add Slice
fi: Lisää siivu

source: Edit Slice
fi: Muokkaa siivua

source: These parameters are generated dynamically when clicking the save or overwrite button in the explore view. This JSON object is exposed here for reference and for power users who may want to alter specific parameters.
fi: Nämä parametrit luodaan dynaamisesti kun tutkintanäkymästä klikataan tallenna- tai ylikirjoita-nappia. Tämä JSON-objekti näytetään tässä tehokäyttäjille jotka saattavat haluta muokata tiettyjä asetuksia.

source: Duration (in seconds) of the caching timeout for this slice.
fi: Välimuistin aikaraja (sekuntia) tälle siivulle

source: Last Modified
fi: Viimeksi muokattu

source: Owners
fi: Omistajat

source: Parameters
fi: Parametrit

source: Slice
fi: Siivu

source: List Dashboards
fi: Listaa infotaulut

source: Show Dashboard
fi: Näytä infotaulu

source: Add Dashboard
fi: Lisää infotaulu

source: Edit Dashboard
fi: Muokkaa infotaulua

source: This json object describes the positioning of the widgets in the dashboard. It is dynamically generated when adjusting the widgets size and positions by using drag & drop in the dashboard view
fi: Tämä JSON-objekti kuvaa widgettien sijaintia infotaulussa. Se luodaan dynaamisesti drag & drop-operaation aikana infotaulu-näkymässä

source: The css for individual dashboards can be altered here, or in the dashboard view where changes are immediately visible
fi: Yksittäisten infotaulujen CSS-tyyliä voidaan muokata joko tässä tai suoraan infotaulu-näkymässä jossa muutokset ovat välittömästi nähtävissä

source: To get a readable URL for your dashboard
fi: Tämän avulla saat helpommin luettavan osoitteen infotaulullesi

source: This JSON object is generated dynamically when clicking the save or overwrite button in the dashboard view. It is exposed here for reference and for power users who may want to alter specific parameters.
fi: Tämä JSON-objekti luodaan dynaamisesti kun infotaulu-näkymässä klikataan Tallenna tai Ylikirjoita. Se näytetään tässä viitteeksi sekä tehokäyttäjille jotka saattavat haluta muokata tiettyjä asetuksia.

source: Owners is a list of users who can alter the dashboard.
fi: Omistajat on lista käyttäjistä jotka voivat muokata infotaulua

source: Dashboard
fi: Infotaulu

source: Position JSON
fi: Sijainti-JSON

source: JSON Metadata
fi: JSON-metatieto

source: Underlying Tables
fi: Taustataulut

source: Export
fi: Vie

source: Export dashboards?
fi: Vie infotaulut?

source: Action
fi: Toiminto

source: Action Log
fi: Toimintaloki

source: Access was requested
fi: Käyttöoikeutta on pyydetty

source: %(user)s was granted the role %(role)s that gives access to the %(datasource)s
fi: Käyttäjälle %(user)s on myönnetty rooli %(role)s joka antaa oikeuden tietolähteeseen %(datasource)s

source: Role %(r)s was extended to provide the access to the datasource %(ds)s
fi: Roolia %(r)s laajennettiin sisältämään oikeus tietolähteeseen %(ds)s

source: You have no permission to approve this request
fi: Sinulla ei ole oikeutta hyväksyä tätä käyttöoikeuspyyntöä

source: Malformed request. slice_id or table_name and db_name arguments are expected
fi: Virheellinen pyyntö. Joko siivun ID (slice_id) TAI parametrit taulun nimi (table_name) sekä tietokannan nimi (db_name) vaaditaan

source: Slice %(id)s not found
fi: Siivua %(id)s ei löydy

source: Table %(t)s wasn't found in the database %(d)s
fi: Taulua %(t)s ei löytynyt tietokannasta %(d)s

source: Can't find User '%(name)s', please ask your admin to create one.
fi: Käyttäjää '%(name)s' ei löydy, pyydä ylläpitäjääsi luomaan sellainen.

source: Can't find DruidCluster with cluster_name = '%(name)s'
fi: Druid-klusteria (cluster_name = '%(name)s') ei löydy

source: Query record was not created as expected.
fi: Kysely-objektia ei luotu niinkuin oletettiin.

source: Template Name
fi: Pohjan nimi

source: CSS Templates
fi: CSS-pohjat

source: SQL Editor
fi: SQL-editori

source: Query Search
fi: Kyselyhaku

source: Status
fi: Tila

source: Start Time
fi: Aloitusaika

source: End Time
fi: Päättymisaika

source: Queries
fi: Kyselyt

source: List Saved Query
fi: Listaa tallennetut kyselyt

source: Show Saved Query
fi: Näytä tallennettu kysely

source: Add Saved Query
fi: Lisää tallennettu kysely

source: Edit Saved Query
fi: Muokkaa tallennettua kyselyä

source: Pop Tab Link
fi: Linkki uuteen välilehteen

source: Changed on
fi: Muokkausaika

source: Saved Queries
fi: Tallennetut kyselyt
